Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/coming_to_live_in_ireland/retiring_to_ireland.html.txt.tmx
Source language: en
Languages: ga

source: If you are thinking of retiring to Ireland, you need to find out about the practicalities involved in moving to Ireland from another country
ga: Má tá tú ag smaoineamh ar theacht go hÉirinn i ndiaidh duit dul ar scor, beidh ort a fháil amach faoi na praiticiúlachtaí a bhaineann le haistriú go hÉirinn ó thír eile

source: The following information outlines the key issues to consider and check and may help you to make a smooth transition from abroad to this country
ga: Tugann an fhaisnéis seo a leanas cur síos duit ar na saincheisteanna is tábhachtaí ar a gcaithfear machnamh a dhéanamh agus a sheiceáil agus b’fhéidir go gcuideodh sé leat aistriú gan fadhbanna ó thír thar lear chuig an tír seo

source: Not everyone has the right to come and live in Ireland
ga: Níl an ceart ag gach aon duine teacht chun cónaí in Éirinn

source: Your right to reside here, depends on your nationality and your particular situation
ga: Braitheann an ceart atá agat chun cónaí anseo ar do náisiúntacht agus ar d’imthosca ar leith

source: • EEA and Swiss nationals: Irish citizens returning to Ireland have an automatic right to reside here and UK citizens may live in Ireland without any conditions or restrictions
ga: • Saoránaigh LEE agus na hEilvéise: Tá ceart uathoibríoch ag saoránaigh Éireannacha atá ag filleadh ar Éirinn a bheith ina gcónaí anseo

source: EEA and Swiss nationals have the right to stay in Ireland and your family members have the right to stay here
ga: Is féidir saoránaigh RA bheith ina gcónaí in Éirinn gan aon choinníollacha nó srianta

source: There are however some limits to this right
ga: Tá teorainneacha leis an gceart seo, áfach

source: EEA and Swiss nationals and their families can remain in Ireland for up to 3 months without restriction
ga: Is féidir le saoránaigh LEE agus na hEilvéise agus a dteaghlaigh fanacht in Éirinn suas le trí mhí gan teorainn

source: If you are retired and plan to stay more than 3 months, you must have sufficient resources and sickness insurance to ensure that you do not become a burden on the State, or you must be employed or self-employed
ga: Má tá tú ar scor agus má tá tú ag beartú fanacht níos mó ná trí mhí, caithfidh go leor acmhainní chomh maith le hárachas sláinte a bheith agat lena chinntiú nach mbeidh tú i d’ualach ar an Stát, nó caithfidh tú a bheith fostaithe nó féinfhostaithe

source: (The European Economic Area (EEA) comprises the member states of the European Union, Iceland, Liechtenstein and Norway.)
ga: (Is é atá sa Limistéar Eorpach Eacnamaíoch (LEE nó EEA i mBéarla) ná ballstáit an Aontais Eorpaigh (AE nó EU), an Íoslainn, Lichtinstéin agus an Iorua)

source: • Non-EEA nationals: citizens of certain non-EEA countries must apply for an entry visa before they travel to Ireland
ga: • Saoránaigh neamh-LEE: Caithfidh saoránaigh ó roinnt tíortha neamh-LEE iarratas a chur isteach ar víosa iontrála sula dtaistealaíonn siad go hÉirinn

source: You can find out if you need a visa to enter Ireland
ga: Is féidir leat a fháil amach má bhíonn víosa le teacht isteach in Éirinn

source: When you have arrived in Ireland, if you are not an EEA or Swiss national, you must have permission to remain if you wish to stay for more than 3 months
ga: de dhíth ort. I ndiaidh duit Éire a bhaint amach, más amhlaidh nach saoránach LEE nó saoránach Eilvéiseach thú, caithfidh tú cead fanachta a bheith agat más mian leat fanacht níos mó ná 3 mhí

source: If you are retiring to live in Ireland, you must be able to prove you have sufficient resources to support yourself and obtain permission to remain by registering with your local immigration registration officer following your arrival in Ireland
ga: Má tá tú ag dul ar scor le bheith i do chónaí in Éirinn, caithfidh tú a bheith ábalta a chruthú go bhfuil go leor acmhainní agat le tú féin a chothabháil agus caithfidh tú cead a fháil le fanacht trí clárú le d’oifigeach cláraithe inimirce áitiúil i ndiaidh duit Éire a bhaint amach

source: You may find that housing is expensive in Ireland, irrespective of whether you are thinking of renting or buying a home
ga: B’fhéidir go gceapfá go bhfuil tithíochta an-chostasach in Éirinn, is cuma cé acu an bhfuil tú ag smaoineamh ar theach a fháil ar cíos nó ar theach a cheannach

source: If you want to buy a home in Ireland you need to be aware of the prices, the process by which houses are bought and sold and the initial costs that are involved
ga: Más maith leat teach a cheannach in Éirinn caithfidh tú a bheith feasach ar threochtaí praghais, an próiseas trína gceannaítear agus a ndíoltar tithe agus na bunchostais lena mbaineann sé

source: There are no restrictions on the purchase or rent of residential property or land
ga: Níl aon teorainneacha ar réadmhaoin chónaitheach nó talamh a cheannach nó a fháil ar cíos

source: Rented accommodation comes in many forms including houses, flats and apartments
ga: Tá a lán cineálacha cóiríochta ar cíos ann, lena n-áirítear tithe, árasáin agus leithleanna

source: If you are thinking of returning, Safe Home Ireland provides information, advice and support to Irish emigrants wishing to return or move to Ireland
ga: Má tá tú ag smaoineamh ar fhilleadh, soláthraíonn Clár um Shábháilteacht sa Bhaile faisnéis, comhairle agus tacaíocht d’eisimircigh Éireannaigh a bhfuil mian leo filleadh nó bogadh go hÉirinn

source: If you are normally resident in Ireland, you are entitled to a range of health services that are either free of charge or subsidised by the Irish Government
ga: Má bhíonn tú i do chónaí in Éirinn de ghnáth, tá tú i dteideal réimse seirbhísí sláinte atá saor ó chostas nó atá fordheonaithe ag Rialtas na hÉireann

source: If you are planning to retire in Ireland you should find out about entitlement to public health services
ga: Má tá tú ag beartú dul ar scor in Éirinn ba cheart duit fáil amach faoi teidlíocht do sheirbhísí sláinte poiblí

source: Depending on your income, you may be eligible for a medical card which entitles you to certain health services at no cost
ga: Ag brath ar d’ioncam, b’fhéidir go mbeifeá incháilithe do cárta leighis lena bhfuil tú i dteideal seibhísí áirithe sláinte gan chostas

source: GP Visit Cards entitle you to free GP Visits
ga: Le Cártaí Cuartaíochta Gnáthdhochtúra tá tú i dteideal cuairteanna gnáthdhochtúra saor in aisce

source: In addition to the public health system, people in Ireland can avail of a range of private health care services
ga: Le cois an chórais sláinte phoiblí, is féidir le daoine in Éirinn réimse seirbhísí príobháideacha cúraim shláinte a úsáid

source: You must pay the full costs of treatment if you opt for private health care
ga: Caithfidh tú costais iomlána na cóireála a íoc má roghnaíonn tú cúram sláinte príobháideach

source: There are a number of private health insurance companies in Ireland
ga: Tá roinnt cuideachtaí árachas sláinte príobháideach in Éirinn

source: If you are normally resident in Ireland, you are entitled to the same benefits from your private health insurance as any other Irish citizen
ga: Má tá tú i do chónaí de ghnáth in Éirinn, tá tú i dteideal na leasa céanna a fháil ó d’árachas príobháideach cúraim shláinte le haon saoránach Éireannach eile

source: Your private health insurance premium attracts tax relief at the standard rate (20%)
ga: Bíonn faoiseamh cánach ar do phréimh don árachas príobháideach sláinte ag an ráta caighdeánach (20%)

source: If you are thinking of coming here to retire, you should find out about the social security system in Ireland
ga: Má tá tú ag smaoineamh ar theacht anseo ar scor, tá sé tábhachtach go mbeifeá ar an eolas faoin córas slándála sóisialaí in Éirinn

source: There may be some significant differences between the system here and your home country
ga: B’fhéidir go mbeadh difríochtaí suntasacha idir an córas anseo agus i do thír bhaile

source: You need to find out more about moving to Ireland and your social security entitlements
ga: Caithfidh tú níos mó a fháil amach faoi aistriú go hÉirinn agus do theidlíochtaí slándála sóisialaí

source: There is a residency requirement to qualify for social assistance payments in Ireland
ga: Tá riachtanais chónaithe le bheith incháilithe d’íocaíochtaí slándála shóisialaigh in Éirinn ann

source: Most long-term contributory pensions such as old age or widowed pensions can be paid in any country so you can have your pension from another country paid in Ireland
ga: Is féidir an chuid is mó de na pinsin ranníocaíocha cosúil le pinsin seanaoise nó pinsin bhaintreachta a íoc in aon tír agus mar sin is féidir leat do phinsin ó thír eile a fháil íoctha in Éirinn

source: There is information available about pensions in Ireland
ga: Tá faisnéis ar fáil faoi pinsin in Éirinn

source: If you have worked in more than one EU/EEA country or in a country with which Ireland has a Bilateral Social Security Agreement then your periods of insurance can be combined with Irish insurance to see if you would qualify for a pension from each country
ga: Má bhí tú ag obair i níos mó ná aon tír AE/LEE nó i dtír a bhfuil Comhaontú Déthaobhach Slándála Sóisialaí ag Éire léi is féidir le do thréimhsí árachais a bheith curtha le chéile le hárachas Éireannach lena fheiceáil an mbeifeá i dteideal pinsean a fháil ó gach tír

source: If you are getting a pension under EU Regulations or a Bilateral Agreement you may be eligible for the Household Benefits Package
ga: Má tá tú ag fáil pinsin faoi rialacháin AE nó faoi Chomhaontú Déthaobhach b’fhéidir go mbeifeá incháilithe don Pacáiste Sochar Teaghlaigh

source: If you are moving to Ireland you need to know about residency for tax purposes
ga: Má tá tú ag aistriú go hÉirinn caithfidh tú a bheith ar an eolas faoi cónaí chun críocha cánach

source: You can find out about income tax credits and reliefs and how pensions are taxed
ga: Is féidir leat a fháil amach faoi creidmheasanna agus faoisimh cánach ioncaim agus conas a ghearrtar cáin ar phinsin

source: There are some special tax arrangements for people aged 65 or over and tax relief is available for certain medical expenses including nursing home costs
ga: Tá roinnt socruithe speisialta cánach do dhaoine atá 65 bliana d’aois nó níos móagus tá faoiseamh cánach ar fáil do roinnt de chostais mhíochaine lena n-áirítear costais tithe altrachta

source: Some retired people may only have retired from one occupation
ga: B’fhéidir go mbeadh roinnt daoine ann atá ar scor agus nár scoir ach ó aon phost amháin

source: Retiring from work therefore may simply signal a career change
ga: B’fhéidir nach mbeadh i ndul ar scor ón obair, mar sin, ach athrú ar shlí bheatha

source: Not everyone has an automatic right to work in Ireland - so check in advance whether you require permission to work in Ireland
ga: Níl cead uathoibríoch ag gach duine a bheith ag obair in Éirinn – mar sin, déan seic roimh réidh an mbeidh cead de dhíth ort le bheith ag obair in Éirinn

source: Most legislation dealing with the protection of employees in Ireland does not have an upper age limit
ga: Níl uasteorainn aoise ag baint leis an gcuid is mó den reachtaíocht a bhaineann le cosaint fostaithe in Éirinn

source: This means that if you are working in retirement, then you have the same employment rights as everyone else
ga: Ciallaíonn sé seo, má tá tú ag obair agus tú ar scor, ansin tá na cearta fostaíochta céanna agat agus atá ag aon duine eile

source: If you decide to work part-time, you can find out about employment rights of part-time workers
ga: Má shocraíonn tú a bheith ag obair go páirtaimseartha, is féidir leat a fháil amach faoi cearta fostaíochta d’oibrithe páirtaimseartha

source: Driving, cars and transport
ga: Tiomáint, carranna agus iompar

source: Full driving licences from all other EU member states (and some other countries) are recognised for use in Ireland
ga: Aithnítear ceadúnais iomlána tiomána ó gach ballstát eile den AE (agus ó roinnt tíortha eile) le húsáid in Éirinn

source: You may be able to convert your driving licence to an Irish one
ga: Ba chóir duit a fháil amach an féidir leat do cheadúnas a aistriú chuig ceadúnas Éireannach ag do cheadúnas tiomána a aistriú chuig ceann Éireannach

source: If you want to bring your car to Ireland you need to know about importing a car and implications for Vehicle Registration Tax (VRT)
ga: Más mian leat do charr a thabhairt go hÉirinn beidh ort a bheith ar an eolas faoi carr a thabhairt isteach sa tír agus na himpleachtaí don Cháin Chláraithe Feithicle (VRT)

source: If you are aged over 66 and living permanently in Ireland you are entitled to free travel on public bus and rail transport
ga: Má tá tú os cionn 66 agus i do chónaí go buan in Éirinn tá tú i dteideal taisteal saor in aisce ar iompar poiblí bus agus iarnróid

source: Other issues for people moving to Ireland
ga: Saincheisteanna eile do dhaoine atá ag aistriú go hÉirinn

source: There are strict regulations about importing pets from abroad and there are customs regulations about the importation of prohibited or restricted goods
ga: Tá rialacháin dochta ann maidir le peataí a allmhairiú ó áit thar lear go hÉirinn, agus tá rialacháin chustaim faoi onnmhairiú earraí srianta nó coiscthe

source: Irish citizens living in Ireland have the right to vote in all elections and referenda
ga: Tá ceart vótála ag saoránaigh Éireannacha atá ina gcónaí in Éirinn i ngach toghchán agus reifreann

source: If you are living in Ireland but are not an Irish citizen you may vote in some elections
ga: Má tá tú i do chónaí in Éirinn ach ní saoránach Éireannach thú, is féidir leat vótáil i dtoghcháin áirithe

source: You can read about the political system at national level and the political system at local level
ga: B’fhéidir gur spéis leat a fhoghlaim faoin an Córas Rialtais Náisiúnta agus an Córas Polaitiúil ag leibheal aitiúil

source: Active retirement is a concept while has become increasingly popular in Ireland and there is a range of organisations which promote education and leisure activities for retired people
ga: Is coincheap é scor gníomhach atá ag éirí níos coitianta in Éirinn agus tá réimse eagraíochtaí anseo a chuireann oideachas agus gníomhaíochtaí fóillíochta do dhaoine ar scor chinn
